In [1]:
import pandas as pd

In [4]:
from pandas import DataFrame,Series

To get started with pandas, you will need to get comfortable with its two workhorse
data structures: Series and DataFrame. While they are not a universal solution for
every problem, they provide a solid, easy-to-use basis for most applications.

In [5]:
obj=pd.Series([0.7,3,4,1,0.78])

In [7]:
obj

0    0.70
1    3.00
2    4.00
3    1.00
4    0.78
dtype: float64

In [8]:
obj.values

array([0.7 , 3.  , 4.  , 1.  , 0.78])

In [9]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [10]:
obj=pd.Series([2,3,4,5],index=['d','a','c','b'])

In [11]:
obj

d    2
a    3
c    4
b    5
dtype: int64

In [12]:
obj.index

Index(['d', 'a', 'c', 'b'], dtype='object')

In [13]:
obj.values

array([2, 3, 4, 5])

In [14]:
obj['a']

3

In [15]:
obj['d']

2

In [16]:
obj[['a','b']]

a    3
b    5
dtype: int64

In [17]:
obj[obj>3]

c    4
b    5
dtype: int64

In [18]:
obj*3

d     6
a     9
c    12
b    15
dtype: int64

In [21]:
import numpy as np

In [22]:
np.exp(obj)

d      7.389056
a     20.085537
c     54.598150
b    148.413159
dtype: float64

In [23]:
'd' in obj

True

In [26]:
2 in obj

False

In [27]:
2 in obj.values

True

Should you have data contained in a Python dict, you can create a Series from it by
passing the dict:

In [28]:
d={'a':12,'b':900,'c':10.4}

In [29]:
obj1=pd.Series(d)

In [30]:
obj1

a     12.0
b    900.0
c     10.4
dtype: float64

In [32]:
s=['a','e','r','b','c']
obj2=pd.Series(d,index=s)

In [33]:
obj2

a     12.0
e      NaN
r      NaN
b    900.0
c     10.4
dtype: float64

In [34]:
pd.isnull(obj2)

a    False
e     True
r     True
b    False
c    False
dtype: bool

In [36]:
obj2[obj2.isnull()]

e   NaN
r   NaN
dtype: float64

In [37]:
obj2[obj2>12]

b    900.0
dtype: float64

In [38]:
pd.notnull(obj2)

a     True
e    False
r    False
b     True
c     True
dtype: bool

In [39]:
obj1.notnull()

a    True
b    True
c    True
dtype: bool

In [40]:
obj1+obj

a     15.0
b    905.0
c     14.4
d      NaN
dtype: float64

In [42]:
obj2.name='data3'
obj2.index.name='data index'

In [43]:
obj2

data index
a     12.0
e      NaN
r      NaN
b    900.0
c     10.4
Name: data3, dtype: float64

In [45]:
obj.index=['puchinki','nipovka','mansion','base']

In [46]:
obj

puchinki    2
nipovka     3
mansion     4
base        5
dtype: int64

## DataFrame
A DataFrame represents a rectangular table of data and contains an ordered collec‐
tion of columns, each of which can be a different value type (numeric, string,
boolean, etc.). The DataFrame has both a row and column index; it can be thought of
as a dict of Series all sharing the same index.

In [47]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [48]:
df=pd.DataFrame(data)

In [49]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

For large DataFrames, the head method selects only the first five rows:

In [50]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [51]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [52]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [54]:
frame1=pd.DataFrame(data,columns=['year','pop','state','city'])

In [55]:
frame1

   year  pop   state city
0  2000  1.5    Ohio  NaN
1  2001  1.7    Ohio  NaN
2  2002  3.6    Ohio  NaN
3  2001  2.4  Nevada  NaN
4  2002  2.9  Nevada  NaN
5  2003  3.2  Nevada  NaN

In [71]:
frame1=pd.DataFrame(data,columns=['year','pop','state','city'],index=['one','two','three','four','five','six'])

In [72]:
frame1

       year  pop   state city
one    2000  1.5    Ohio  NaN
two    2001  1.7    Ohio  NaN
three  2002  3.6    Ohio  NaN
four   2001  2.4  Nevada  NaN
five   2002  2.9  Nevada  NaN
six    2003  3.2  Nevada  NaN

In [60]:
frame1.columns

Index(['year', 'pop', 'state', 'city'], dtype='object')

In [62]:
frame1['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [68]:
frame1.year='y'

In [69]:
frame1.year

one      y
two      y
three    y
four     y
five     y
six      y
Name: year, dtype: object

In [70]:
frame1

      year  pop   state city
one      y  1.5    Ohio  NaN
two      y  1.7    Ohio  NaN
three    y  3.6    Ohio  NaN
four     y  2.4  Nevada  NaN
five     y  2.9  Nevada  NaN
six      y  3.2  Nevada  NaN

In [73]:
frame1

       year  pop   state city
one    2000  1.5    Ohio  NaN
two    2001  1.7    Ohio  NaN
three  2002  3.6    Ohio  NaN
four   2001  2.4  Nevada  NaN
five   2002  2.9  Nevada  NaN
six    2003  3.2  Nevada  NaN

Attribute-like access (e.g., frame2.year ) and tab completion of col‐
umn names in IPython is provided as a convenience.
frame2[column] works for any column name, but frame2.column
only works when the column name is a valid Python variable
name.

Rows can also be retrieved by position or name with the special loc attribute (much
more on this later):

In [74]:

frame1.loc['two']

year     2001
pop       1.7
state    Ohio
city      NaN
Name: two, dtype: object

Columns can be modified by assignment. For example, the empty 'debt' column
could be assigned a scalar value or an array of values:

In [76]:
frame1['city']='pune'

In [77]:
frame1

       year  pop   state  city
one    2000  1.5    Ohio  pune
two    2001  1.7    Ohio  pune
three  2002  3.6    Ohio  pune
four   2001  2.4  Nevada  pune
five   2002  2.9  Nevada  pune
six    2003  3.2  Nevada  pune

In [78]:
val=pd.Series([1.2,0.5,5],index=['two','three','one'])

In [79]:
frame1['value']=val

In [80]:
frame1

       year  pop   state  city  value
one    2000  1.5    Ohio  pune    5.0
two    2001  1.7    Ohio  pune    1.2
three  2002  3.6    Ohio  pune    0.5
four   2001  2.4  Nevada  pune    NaN
five   2002  2.9  Nevada  pune    NaN
six    2003  3.2  Nevada  pune    NaN

new columns can not be created by frame1.values syntax

The del method can then be used to remove this column:

In [82]:
del frame1['value']

In [83]:
frame1

       year  pop   state  city
one    2000  1.5    Ohio  pune
two    2001  1.7    Ohio  pune
three  2002  3.6    Ohio  pune
four   2001  2.4  Nevada  pune
five   2002  2.9  Nevada  pune
six    2003  3.2  Nevada  pune

Another common form of data is a nested dict of dicts:

In [93]:
pop={'state':{'UP':1,'MP':2,'Delhi':3,'HP':4}, 'city':{'UP':5,'Ind':5,'dwk':7,'Shim':8}}

In [94]:
frame2=pd.DataFrame(pop)

In [95]:
frame2

       state  city
Delhi    3.0   NaN
HP       4.0   NaN
Ind      NaN   5.0
MP       2.0   NaN
Shim     NaN   8.0
UP       1.0   5.0
dwk      NaN   7.0

You can transpose the DataFrame (swap rows and columns) with similar syntax to a
NumPy array:

In [96]:
frame2.T

       Delhi   HP  Ind   MP  Shim   UP  dwk
state    3.0  4.0  NaN  2.0   NaN  1.0  NaN
city     NaN  NaN  5.0  NaN   8.0  5.0  7.0

In [97]:
frame1.T

        one   two three    four    five     six
year   2000  2001  2002    2001    2002    2003
pop     1.5   1.7   3.6     2.4     2.9     3.2
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
city   pune  pune  pune    pune    pune    pune

In [99]:
pd.DataFrame(pop,index=['a','b','c','MP'])

    state  city
a     NaN   NaN
b     NaN   NaN
c     NaN   NaN
MP    2.0   NaN

In [103]:
pdata={'nevada':frame1['Nevada'][:2]}

KeyError: 'Nevada'

In [104]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [105]:
frame3=pd.DataFrame(pop)

In [106]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [107]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [108]:
frame4=pd.DataFrame(pdata)

In [109]:
frame4

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [110]:
frame4.index.name='year'

In [111]:
frmae4

NameError: name 'frmae4' is not defined

In [112]:
frame4

      Ohio  Nevada
year
2000   1.5     NaN
2001   1.7     2.4

In [114]:
frame4.columns.name='state'

In [115]:
frame4

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4

In [116]:
frame2.values

array([[ 3., nan],
       [ 4., nan],
       [nan,  5.],
       [ 2., nan],
       [nan,  8.],
       [ 1.,  5.],
       [nan,  7.]])

In [117]:
frame4.values

array([[1.5, nan],
       [1.7, 2.4]])

If the DataFrame’s columns are different dtypes, the dtype of the values array will be
chosen to accommodate all of the columns:

In [121]:
frame2.values

array([[ 3., nan],
       [ 4., nan],
       [nan,  5.],
       [ 2., nan],
       [nan,  8.],
       [ 1.,  5.],
       [nan,  7.]])

In [122]:
pd.DataFrame(np.arange(9).reshape(3,3))

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [124]:
obj=pd.Series(range(3),index=['a','b','c'])

In [125]:
index=obj.index

In [126]:
index

Index(['a', 'b', 'c'], dtype='object')

In [127]:
index[:2]

Index(['a', 'b'], dtype='object')

In [128]:
index[1]='d'

TypeError: Index does not support mutable operations

index objects are immutable and thus can't be modified by the user

In [131]:
labels=pd.Index(np.arange(10))

In [133]:
labels

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [136]:
pd.DataFrame(np.arange(9).reshape(3,3),index=['a','a','c'],columns=['val1','val2','val3'])

   val1  val2  val3
a     0     1     2
a     3     4     5
c     6     7     8

In [137]:
frame4=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','a','c'],columns=['val1','val2','val3'])

In [139]:
frame4.index

Index(['a', 'a', 'c'], dtype='object')

In [140]:
lables=pd.Index(['aa','bb','cc'])

In [141]:
type(lables)

pandas.core.indexes.base.Index

#### Essential FUnctionality

###### Reindexing

An important method on pandas objects is reindex , which means to create a new
object with the data conformed to a new index. Consider an example:

In [142]:
frame1=pd.DataFrame([1,2,3,4],index=['a','b','c','d'])

In [143]:
frame1

   0
a  1
b  2
c  3
d  4

In [144]:
frame1.reindex(['b','d','f','a','c'])

     0
b  2.0
d  4.0
f  NaN
a  1.0
c  3.0

In [145]:
frame1

   0
a  1
b  2
c  3
d  4

In [148]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[2,0, 4])

In [149]:
obj3

2      blue
0    purple
4    yellow
dtype: object

In [152]:
obj3.reindex(range(4),method='ffill')

ValueError: index must be monotonic increasing or decreasing

In [153]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2, 4])

In [154]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [156]:
obj3.reindex(range(9),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
8    yellow
dtype: object

In [158]:
obj3.reindex(['a',0,2])

a       NaN
0      blue
2    purple
dtype: object

In [162]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [163]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [164]:
frame2=frame.reindex(['a','b','c','d'])

In [165]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [166]:
states = ['Texas', 'Utah', 'California']

In [172]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [171]:
frame.reindex(columns=['u','T'])

    u   T
a NaN NaN
c NaN NaN
d NaN NaN

drop for deleting index(rows)

In [173]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [174]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [175]:
data.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [176]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [180]:
data.drop(['Ohio','Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

You can drop values from the columns by passing axis=1 or axis='columns' :

In [188]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [189]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [191]:
data.drop(['one','three'],axis='columns')

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

Many functions, like drop , which modify the size or shape of a Series or DataFrame,
can manipulate an object in-place without returning a new object:

In [192]:
obj

a    0
b    1
c    2
dtype: int64

In [193]:
obj.drop('c',inplace=True)

In [194]:
obj

a    0
b    1
dtype: int64

#### Indexing, Selection, and Filtering

Series indexing ( obj[...] ) works analogously to NumPy array indexing, except you
can use the Series’s index values instead of only integers. Here are some examples of
this:

In [195]:
s1=pd.Series(np.arange(4.),index=['a','b','c','d'])

In [196]:
s1

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [197]:
s1[:2]

a    0.0
b    1.0
dtype: float64

In [198]:
s1['d']

3.0

In [199]:
s1[[1,2]]

b    1.0
c    2.0
dtype: float64

In [200]:
s1[[3]]

d    3.0
dtype: float64

In [201]:
s1[[1,3]]

b    1.0
d    3.0
dtype: float64

In [202]:
s1[s1<3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [203]:
s1[0]

0.0

In [205]:
s1[2]

2.0

In [206]:
s1[-1]

3.0

In [207]:
s1[:-1]

a    0.0
b    1.0
c    2.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the end‐
point is inclusive:

In [208]:
s1['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [209]:
s1['b':'d']=5

In [210]:
s1

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [211]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [212]:
frame['Ohio']

a    0
c    3
d    6
Name: Ohio, dtype: int64

In [213]:
frame[['Ohio','Texas']]

   Ohio  Texas
a     0      1
c     3      4
d     6      7

In [214]:
frame[:2]

   Ohio  Texas  California
a     0      1           2
c     3      4           5

In [215]:
frame[frame['Ohio']>2]

   Ohio  Texas  California
c     3      4           5
d     6      7           8

In [216]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [217]:
frame.reindex(index=['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [218]:
s1.loc['b']

5.0

In [219]:
s1.loc['a']

0.0

In [221]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [222]:
frame<5

    Ohio  Texas  California
a   True   True        True
c   True   True       False
d  False  False       False

In [223]:
frame[frame<5]=0

In [224]:
frame

   Ohio  Texas  California
a     0      0           0
c     0      0           5
d     6      7           8

In [225]:
frame

   Ohio  Texas  California
a     0      0           0
c     0      0           5
d     6      7           8

In [228]:
frame.loc[['a','d']]

   Ohio  Texas  California
a     0      0           0
d     6      7           8

In [229]:
frame.loc['c',['Texas','Ohio']]

Texas    0
Ohio     0
Name: c, dtype: int64

In [231]:
ser=pd.Series(np.arange(6.))

In [237]:
ser

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
dtype: float64

In [245]:
ser=pd.Series(np.arange(3),index=['a','b','c'])

In [246]:
ser[-1]

2

In [248]:
ser=pd.Series(np.random.randn(3),index=[0,1,2])

In [249]:
ser[-1]

KeyError: -1

In [250]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])

In [251]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [253]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [254]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [255]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [264]:
df2.loc[0,'e']=np.nan

In [265]:
df2

          b     d     e  (0, e)  (Utah, e)
Utah    0.0   1.0   NaN     NaN        NaN
Ohio    3.0   4.0   5.0     NaN        NaN
Texas   6.0   7.0   8.0     NaN        NaN
Oregon  9.0  10.0  11.0     NaN        NaN
3       NaN   NaN   NaN     NaN        NaN
0       NaN   NaN   NaN     NaN        NaN

In [270]:
df1.add(df2,fill_value=0)

/home/icpl13698/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:8450: RuntimeWarning: '<' not supported between instances of 'str' and 'int', sort order is undefined for incomparable objects
  other.columns, how=join, level=level, return_indexers=True)

            b    c     d     e  (0, e)  (Utah, e)
0         NaN  NaN   NaN   NaN     NaN        NaN
3         NaN  NaN   NaN   NaN     NaN        NaN
Colorado  6.0  7.0   8.0   NaN     NaN        NaN
Ohio      3.0  1.0   6.0   5.0     NaN        NaN
Oregon    9.0  NaN  10.0  11.0     NaN        NaN
Texas     9.0  4.0  12.0   8.0     NaN        NaN
Utah      0.0  NaN   1.0   NaN     NaN        NaN

In [276]:
df1*10

             b     c     d
Ohio       0.0  10.0  20.0
Texas     30.0  40.0  50.0
Colorado  60.0  70.0  80.0

#### Function Application and Mapping

NumPy ufuncs (element-wise array methods) also work with pandas objects:

In [277]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [278]:
frame

               b         d         e
Utah    0.033526  0.219741 -0.402631
Ohio   -1.120380  0.014851 -0.318537
Texas   0.544680 -0.749793 -0.797319
Oregon -0.362410 -0.779975  1.252411

In [279]:
np.abs(frame)

               b         d         e
Utah    0.033526  0.219741  0.402631
Ohio    1.120380  0.014851  0.318537
Texas   0.544680  0.749793  0.797319
Oregon  0.362410  0.779975  1.252411

In [280]:
f=lambda x:x.max()-x.min()

In [291]:
frame.apply(f,axis=1)

Utah      0.622372
Ohio      1.135231
Texas     1.342000
Oregon    2.032386
dtype: float64

In [284]:
frame.apply(f,axis=0)

b    1.665061
d    0.999717
e    2.049730
dtype: float64

The function passed to apply need not return a scalar value; it can also return a Series
with multiple values:

In [287]:
def func(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])

In [288]:
frame.apply(func)

           b         d         e
min -1.12038 -0.779975 -0.797319
max  0.54468  0.219741  1.252411

In [289]:
frame.apply(func,axis='columns')

             min       max
Utah   -0.402631  0.219741
Ohio   -1.120380  0.014851
Texas  -0.797319  0.544680
Oregon -0.779975  1.252411

Element-wise Python functions can be used, too. Suppose you wanted to compute a
formatted string from each floating-point value in frame . You can do this with apply
map :

In [294]:
format=lambda x: '%.2f'%x

In [295]:
frame.applymap(format)

            b      d      e
Utah     0.03   0.22  -0.40
Ohio    -1.12   0.01  -0.32
Texas    0.54  -0.75  -0.80
Oregon  -0.36  -0.78   1.25

The reason for the name applymap is that Series has a map method for applying an
element-wise function

In [300]:
frame['e'].apply(format)

Utah      -0.40
Ohio      -0.32
Texas     -0.80
Oregon     1.25
Name: e, dtype: object

In [301]:
frame['e'].map(format)

Utah      -0.40
Ohio      -0.32
Texas     -0.80
Oregon     1.25
Name: e, dtype: object

#### Sorting and Ranking

Sorting a dataset by some criterion is another important built-in operation. To sort
lexicographically by row or column index, use the sort_index method, which returns
a new, sorted object:

In [302]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [303]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [305]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [306]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [307]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [308]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [311]:
frame.sort_values(['a','b'])

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [313]:
frame['b']['three']=9

In [314]:
frame

       d  a  b  c
three  0  1  9  3
one    4  5  6  7

In [315]:
frame.sort_values(['b','a'])

       d  a  b  c
one    4  5  6  7
three  0  1  9  3

In [316]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  9  3  0
one    5  6  7  4

In [317]:
frame.sort_index(axis='columns',ascending=False)

       d  c  b  a
three  0  3  9  1
one    4  7  6  5

Any missing values are sorted to the end of the Series by default:

In [319]:
obj=pd.Series([3.2,np.nan,4,np.nan,7,-3,-2])

In [320]:
obj

0    3.2
1    NaN
2    4.0
3    NaN
4    7.0
5   -3.0
6   -2.0
dtype: float64

In [321]:
obj.sort_values()

5   -3.0
6   -2.0
0    3.2
2    4.0
4    7.0
1    NaN
3    NaN
dtype: float64

In [322]:
frame.sort_values(by='b')

       d  a  b  c
one    4  5  6  7
three  0  1  9  3

In [323]:
frame.sort_values(by=['a','b'])

       d  a  b  c
three  0  1  9  3
one    4  5  6  7

#### Ranking

Ranking assigns ranks from one through the number of valid data points in an array.
The rank methods for Series and DataFrame are the place to look; by default rank
breaks ties by assigning each group the mean rank:

In [324]:
obj=pd.Series(C)

In [325]:
obj

0   -4
1   -2
2    7
3    3
4    2
5    5
6    1
7    5
dtype: int64

In [326]:
obj.rank()

0    1.0
1    2.0
2    8.0
3    5.0
4    4.0
5    6.5
6    3.0
7    6.5
dtype: float64

In [327]:
obj.rank(method='first')

0    1.0
1    2.0
2    8.0
3    5.0
4    4.0
5    6.0
6    3.0
7    7.0
dtype: float64

In [329]:
obj.rank(method='first',ascending=False)

0    8.0
1    7.0
2    1.0
3    4.0
4    5.0
5    2.0
6    6.0
7    3.0
dtype: float64

In [330]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]})

In [331]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [333]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [334]:
frame.rank(axis='index')

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [335]:
obj.rank(method='dense')

0    1.0
1    2.0
2    7.0
3    5.0
4    4.0
5    6.0
6    3.0
7    6.0
dtype: float64

In [336]:
obj.index.is_unique

True

In [338]:
obj.index.is_monotonic_increasing

True

Data selection is one of the main things that behaves differently with duplicates.
Indexing a label with multiple entries returns a Series, while single entries return a
scalar value:

In [352]:
obj=pd.Series(list('12345'),index=list('abade'))

In [353]:
obj

a    1
b    2
a    3
d    4
e    5
dtype: object

In [354]:
obj.values

array(['1', '2', '3', '4', '5'], dtype=object)

In [355]:
obj.index

Index(['a', 'b', 'a', 'd', 'e'], dtype='object')

In [356]:
obj['a']

a    1
a    3
dtype: object

In [358]:
obj['d']

'4'

In [359]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [360]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [361]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [362]:
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [363]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [364]:
df.sum(axis=1,skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [367]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [368]:
df.idxmax()

one    b
two    d
dtype: object

In [369]:
df.idxmin()

one    d
two    b
dtype: object

Some methods, like idxmin and idxmax , return indirect statistics like the index value
where the minimum or maximum values are attained:

In [370]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [371]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

cumsum() returns cumulative sum

In [372]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

describe produces multiple summary statistics

On non-numeric data, describe produces alternative summary statistics:

In [373]:
obj=pd.Series(list("abcd")*4)

In [374]:
obj

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [375]:
obj.describe()

count     16
unique     4
top        b
freq       4
dtype: object

##### Corelation and covariance

Some summary statistics, like correlation and covariance, are computed from pairs of
arguments. Let’s consider some DataFrames of stock prices and volumes obtained
from Yahoo! Finance using the add-on pandas-datareader package. If you don’t
have it installed already, it can be obtained via conda or pip:

In [377]:
conda install pandas-datareader

WARNING: The conda.compat module is deprecated and will be removed in a future release.
Collecting package metadata: done
Solving environment: done

## Package Plan ##

  environment location: /home/icpl13698/anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.6.14               |           py37_0         2.1 MB
    pandas-datareader-0.7.0    |           py37_0         142 KB
    ------------------------------------------------------------
                                           Total:         2.3 MB

The following NEW packages will be INSTALLED:

  pandas-datareader  pkgs/main/linux-64::pandas-datareader-0.7.0-py37_0

The following packages will be UPDATED:

  conda                                       4.6.11-py37_0 --> 4.6.14-py37_0



Downloading and Extracting Packages
pandas-datareader-0. | 142 KB    | ##################################### | 100%
conda-4.6.14         | 2.1 MB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas_datareader.data as web

In [3]:
all_data={ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [4]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.478571   30.080000   30.447144   30.104286   88102700.0
 2010-01-04   30.642857   30.340000   30.490000   30.572857  123432400.0
 2010-01-05   30.798571   30.464285   30.657143   30.625713  150476200.0
 2010-01-06   30.747143   30.107143   30.625713   30.138571  138040000.0
 2010-01-07   30.285715   29.864286   30.250000   30.082857  119282800.0
 2010-01-08   30.285715   29.865715   30.042856   30.282858  111902700.0
 2010-01-11   30.428572   29.778572   30.400000   30.015715  115557400.0
 2010-01-12   29.967142   29.488571   29.884285   29.674286  148614900.0
 2010-01-13   30.132856   29.157143   29.695715   30.092857  151473000.0
 2010-01-14   30.065714   29.860001   30.015715   29.918571  108223500.0
 2010-01-15   30.228571   29.410000   30.132856   29.418571  148516900.0
 2010-01-19   30.741428   29.605715   29.761429   30.719999  182501900.0
 2010-01-20   30.792856   29.928572   30.701429   30.247143  153038200.0
 2010-01-21   30.472857   29.601429   30.297142   29.724285  152038600.0
 2010-01-22   29.642857   28.165714   29.540001   28.250000  220441900.0
 2010-01-25   29.242857   28.598572   28.930000   29.010000  266424900.0
 2010-01-26   30.530001   28.940001   29.421429   29.420000  466777500.0
 2010-01-27   30.082857   28.504286   29.549999   29.697144  430642100.0
 2010-01-28   29.357143   28.385714   29.275715   28.469999  293375600.0
 2010-01-29   28.885714   27.178572   28.725714   27.437143  311488100.0
 2010-02-01   28.000000   27.328571   27.481428   27.818571  187469100.0
 2010-02-02   28.045713   27.625713   27.987143   27.980000  174585600.0
 2010-02-03   28.600000   27.774286   27.881428   28.461428  153832000.0
 2010-02-04   28.338572   27.367144   28.104286   27.435715  189413000.0
 2010-02-05   28.000000   27.264286   27.518572   27.922857  212576700.0
 2010-02-08   28.268572   27.714285   27.955715   27.731428  119567700.0
 2010-02-09   28.214285   27.821428   28.059999   28.027143  158221700.0
 2010-02-10   28.085714   27.751429   27.984285   27.874287   92590400.0
 2010-02-11   28.535715   27.722857   27.840000   28.381428  137586400.0
 2010-02-12   28.805714   27.928572   28.301428   28.625713  163867200.0
 ...                ...         ...         ...         ...          ...
 2019-03-26  192.880005  184.580002  191.660004  186.789993   49800500.0
 2019-03-27  189.759995  186.550003  188.750000  188.470001   29848400.0
 2019-03-28  189.559998  187.529999  188.949997  188.720001   20780400.0
 2019-03-29  190.080002  188.539993  189.830002  189.949997   23564000.0
 2019-04-01  191.679993  188.380005  191.639999  191.240005   27862000.0
 2019-04-02  194.460007  191.050003  191.089996  194.020004   22765700.0
 2019-04-03  196.500000  193.149994  193.250000  195.350006   23271800.0
 2019-04-04  196.369995  193.139999  194.789993  195.690002   19114300.0
 2019-04-05  197.100006  195.929993  196.449997  197.000000   18526600.0
 2019-04-08  200.229996  196.339996  196.419998  200.100006   25881700.0
 2019-04-09  202.850006  199.229996  200.320007  199.500000   35768200.0
 2019-04-10  200.740005  198.179993  198.679993  200.619995   21695300.0
 2019-04-11  201.000000  198.440002  200.850006  198.949997   20900800.0
 2019-04-12  200.139999  196.210007  199.199997  198.869995   27760700.0
 2019-04-15  199.850006  198.009995  198.580002  199.229996   17536600.0
 2019-04-16  201.369995  198.559998  199.460007  199.250000   25696400.0
 2019-04-17  203.380005  198.610001  199.539993  203.130005   28906800.0
 2019-04-18  204.149994  202.520004  203.119995  203.860001   24195800.0
 2019-04-22  204.940002  202.339996  202.830002  204.529999   19439500.0
 2019-04-23  207.750000  203.899994  204.429993  207.479996   23323000.0
 2019-04-24  208.479996  207.050003  207.360001  207.160004   17540600.0
 2019-04-25  207.759995  205.119995  206.830002  205.279999   18543200.0
 2019-04-26  205.000000  202.119995  204.899994  204.300003   18649100.0
 2019-04-29  205.970001  203.860001  204.399994  204.610001   22204700.0
 2019-04-30  203.399994  199.110001  203.059998  200.669998   46534900.0
 2019-05-01  215.309998  209.229996  209.880005  210.520004   64827300.0
 2019-05-02  212.649994  208.130005  209.839996  209.149994   31996300.0
 2019-05-03  211.839996  210.229996  210.889999  211.750000   20892400.0
 2019-05-06  208.839996  203.500000  204.289993  208.479996   32443100.0
 2019-05-07  207.419998  200.830002  205.880005  202.860001   38705800.0

              Adj Close
 Date
 2009-12-31   20.073631
 2010-01-04   20.386072
 2010-01-05   20.421322
 2010-01-06   20.096491
 2010-01-07   20.059338
 2010-01-08   20.192701
 2010-01-11   20.014568
 2010-01-12   19.786903
 2010-01-13   20.066006
 2010-01-14   19.949797
 2010-01-15   19.616390
 2010-01-19   20.484186
 2010-01-20   20.168890
 2010-01-21   19.820242
 2010-01-22   18.837185
 2010-01-25   19.343958
 2010-01-26   19.617346
 2010-01-27   19.802147
 2010-01-28   18.983883
 2010-01-29   18.295170
 2010-02-01   18.549507
 2010-02-02   18.657150
 2010-02-03   18.978167
 2010-02-04   18.294220
 2010-02-05   18.619045
 2010-02-08   18.491404
 2010-02-09   18.688580
 2010-02-10   18.586657
 2010-02-11   18.924822
 2010-02-12   19.087709
 ...                ...
 2019-03-26  186.789993
 2019-03-27  188.470001
 2019-03-28  188.720001
 2019-03-29  189.949997
 2019-04-01  191.240005
 2019-04-02  194.020004
 2019-04-03  195.350006
 2019-04-04  195.690002
 2019-04-05  197.000000
 2019-04-08  200.100006
 2019-04-09  199.500000
 2019-04-10  200.619995
 2019-04-11  198.949997
 2019-04-12  198.869995
 2019-04-15  199.229996
 2019-04-16  199.250000
 2019-04-17  203.130005
 2019-04-18  203.860001
 2019-04-22  204.529999
 2019-04-23  207.479996
 2019-04-24  207.160004
 2019-04-25  205.279999
 2019-04-26  204.300003
 2019-04-29  204.610001
 2019-04-30  200.669998
 2019-05-01  210.520004
 2019-05-02  209.149994
 2019-05-03  211.750000
 2019-05-06  208.479996
 2019-05-07  202.860001

 [2352 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0
 2010-01-04  132.970001  130.850006  131.179993  132.449997   6155300.0
 2010-01-05  131.850006  130.100006  131.679993  130.850006   6841400.0
 2010-01-06  131.490005  129.809998  130.679993  130.000000   5605300.0
 2010-01-07  130.250000  128.910004  129.869995  129.550003   5840600.0
 2010-01-08  130.919998  129.050003  129.070007  130.850006   4197200.0
 2010-01-11  131.059998  128.669998  131.059998  129.479996   5730400.0
 2010-01-12  131.330002  129.000000  129.029999  130.509995   8081500.0
 2010-01-13  131.119995  129.160004  130.389999  130.229996   6455400.0
 2010-01-14  132.710007  129.910004  130.550003  132.309998   7111800.0
 2010-01-15  132.889999  131.089996  132.029999  131.779999   8494400.0
 2010-01-19  134.250000  131.559998  131.630005  134.139999  13916200.0
 2010-01-20  131.149994  128.949997  130.460007  130.250000  15197500.0
 2010-01-21  130.690002  128.059998  130.470001  129.000000   9608600.0
 2010-01-22  128.889999  125.370003  128.669998  125.500000  10088600.0
 2010-01-25  126.889999  125.709999  126.330002  126.120003   5738500.0
 2010-01-26  127.750000  125.410004  125.919998  125.750000   7135300.0
 2010-01-27  126.959999  125.040001  125.820000  126.330002   8719200.0
 2010-01-28  127.040001  123.050003  127.029999  123.750000   9622200.0
 2010-01-29  125.000000  121.900002  124.320000  122.389999  11571200.0
 2010-02-01  124.949997  122.779999  123.230003  124.669998   7242900.0
 2010-02-02  125.809998  123.949997  124.790001  125.529999   5899900.0
 2010-02-03  126.070000  125.070000  125.160004  125.660004   4177100.0
 2010-02-04  125.440002  122.900002  125.190002  123.000000   9126900.0
 2010-02-05  123.720001  121.830002  123.040001  123.519997   8617000.0
 2010-02-08  123.220001  121.739998  123.150002  121.879997   5718500.0
 2010-02-09  124.199997  122.459999  122.650002  123.209999   6044500.0
 2010-02-10  123.650002  122.209999  122.940002  122.809998   5219100.0
 2010-02-11  124.199997  122.059998  122.580002  123.730003   5089000.0
 2010-02-12  124.050003  121.610001  123.010002  124.000000   8017700.0
 ...                ...         ...         ...         ...         ...
 2019-03-26  141.020004  139.419998  139.929993  140.220001   2553700.0
 2019-03-27  140.490005  138.399994  140.410004  139.240005   3098200.0
 2019-03-28  140.440002  139.100006  139.910004  139.919998   2663900.0
 2019-03-29  141.220001  140.149994  140.500000  141.100006   3101400.0
 2019-04-01  143.410004  141.509995  141.509995  143.300003   3984300.0
 2019-04-02  143.949997  142.600006  143.350006  143.000000   2404800.0
 2019-04-03  144.220001  143.009995  143.649994  143.630005   2681200.0
 2019-04-04  144.139999  142.539993  143.619995  142.779999   2771100.0
 2019-04-05  143.500000  142.460007  143.289993  143.279999   2731800.0
 2019-04-08  143.419998  142.869995  143.020004  143.389999   2118200.0
 2019-04-09  142.949997  141.839996  142.660004  142.110001   3038500.0
 2019-04-10  143.500000  141.979996  142.199997  143.020004   2678000.0
 2019-04-11  144.110001  143.029999  143.800003  143.779999   2942000.0
 2019-04-12  144.440002  143.699997  144.259995  144.350006   2898900.0
 2019-04-15  144.460007  143.270004  144.399994  143.899994   3603200.0
 2019-04-16  145.389999  144.020004  144.399994  145.139999   6301700.0
 2019-04-17  141.979996  136.259995  137.369995  139.110001  12525700.0
 2019-04-18  140.490005  138.699997  139.000000  140.330002   4960000.0
 2019-04-22  140.559998  138.479996  139.419998  138.889999   4494000.0
 2019-04-23  140.919998  138.940002  139.149994  140.440002   4462200.0
 2019-04-24  141.309998  139.779999  140.600006  139.949997   2774900.0
 2019-04-25  139.750000  137.710007  139.699997  138.630005   2910100.0
 2019-04-26  139.889999  138.809998  139.339996  139.440002   2319800.0
 2019-04-29  139.630005  138.809998  139.149994  139.050003   2958300.0
 2019-04-30  140.440002  138.679993  139.110001  140.270004   4638800.0
 2019-05-01  141.809998  140.169998  140.550003  140.559998   3053700.0
 2019-05-02  141.279999  139.410004  140.500000  139.589996   3541400.0
 2019-05-03  141.000000  139.630005  139.699997  140.250000   2579900.0
 2019-05-06  140.690002  137.899994  138.300003  140.380005   2793300.0
 2019-05-07  139.509995  136.190002  139.149994  137.639999   4718500.0

              Adj Close
 Date
 2009-12-31   99.303009
 2010-01-04  100.478867
 2010-01-05   99.265091
 2010-01-06   98.620255
 2010-01-07   98.278870
 2010-01-08   99.265091
 2010-01-11   98.225777
 2010-01-12   99.007156
 2010-01-13   98.794746
 2010-01-14  100.372673
 2010-01-15   99.970589
 2010-01-19  101.760918
 2010-01-20   98.809929
 2010-01-21   97.861649
 2010-01-22   95.206505
 2010-01-25   95.676834
 2010-01-26   95.396156
 2010-01-27   95.836143
 2010-01-28   93.878906
 2010-01-29   92.847176
 2010-02-01   94.576828
 2010-02-02   95.229240
 2010-02-03   95.327866
 2010-02-04   93.309929
 2010-02-05   93.704422
 2010-02-08   92.873825
 2010-02-09   93.887291
 2010-02-10   93.582497
 2010-02-11   94.283569
 2010-02-12   94.489265
 ...                ...
 2019-03-26  140.220001
 2019-03-27  139.240005
 2019-03-28  139.919998
 2019-03-29  141.100006
 2019-04-01  143.300003
 2019-04-02  143.000000
 2019-04-03  143.630005
 2019-04-04  142.779999
 2019-04-05  143.279999
 2019-04-08  143.389999
 2019-04-09  142.110001
 2019-04-10  143.020004
 2019-04-11  143.779999
 2019-04-12  144.350006
 2019-04-15  143.899994
 2019-04-16  145.139999
 2019-04-17  139.110001
 2019-04-18  140.330002
 2019-04-22  138.889999
 2019-04-23  140.440002
 2019-04-24  139.949997
 2019-04-25  138.630005
 2019-04-26  139.440002
 2019-04-29  139.050003
 2019-04-30  140.270004
 2019-05-01  140.559998
 2019-05-02  139.589996
 2019-05-03  140.250000
 2019-05-06  140.380005
 2019-05-07  137.639999

 [2352 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.990000   30.480000   30.980000   30.480000   31929700.0
 2010-01-04   31.100000   30.590000   30.620001   30.950001   38409100.0
 2010-01-05   31.100000   30.639999   30.850000   30.959999   49749600.0
 2010-01-06   31.080000   30.520000   30.879999   30.770000   58182400.0
 2010-01-07   30.700001   30.190001   30.629999   30.450001   50559700.0
 2010-01-08   30.879999   30.240000   30.280001   30.660000   51197400.0
 2010-01-11   30.760000   30.120001   30.709999   30.270000   68754700.0
 2010-01-12   30.400000   29.910000   30.150000   30.070000   65912100.0
 2010-01-13   30.520000   30.010000   30.260000   30.350000   51863500.0
 2010-01-14   31.100000   30.260000   30.309999   30.959999   63228100.0
 2010-01-15   31.240000   30.709999   31.080000   30.860001   79913200.0
 2010-01-19   31.240000   30.680000   30.750000   31.100000   46575700.0
 2010-01-20   30.940001   30.309999   30.809999   30.590000   54849500.0
 2010-01-21   30.719999   30.000000   30.610001   30.010000   73086700.0
 2010-01-22   30.200001   28.840000   30.000000   28.959999  102004600.0
 2010-01-25   29.660000   29.100000   29.240000   29.320000   63373000.0
 2010-01-26   29.850000   29.090000   29.200001   29.500000   66639900.0
 2010-01-27   29.820000   29.020000   29.350000   29.670000   63949500.0
 2010-01-28   29.870001   28.889999   29.840000   29.160000  117513700.0
 2010-01-29   29.920000   27.660000   29.900000   28.180000  193888500.0
 2010-02-01   28.480000   27.920000   28.389999   28.410000   85931100.0
 2010-02-02   28.500000   28.139999   28.370001   28.459999   54413700.0
 2010-02-03   28.790001   28.120001   28.260000   28.629999   61397900.0
 2010-02-04   28.500000   27.809999   28.379999   27.840000   77850000.0
 2010-02-05   28.280001   27.570000   28.000000   28.020000   80960100.0
 2010-02-08   28.080000   27.570000   28.010000   27.719999   52820600.0
 2010-02-09   28.340000   27.750000   27.969999   28.010000   59195800.0
 2010-02-10   28.240000   27.840000   28.030001   27.990000   48591300.0
 2010-02-11   28.400000   27.700001   27.930000   28.120001   65993700.0
 2010-02-12   28.059999   27.580000   27.809999   27.930000   81117200.0
 ...                ...         ...         ...         ...          ...
 2019-03-26  118.709999  116.849998  118.620003  117.910004   26097700.0
 2019-03-27  118.209999  115.519997  117.879997  116.769997   22733400.0
 2019-03-28  117.580002  116.129997  117.440002  116.930000   18334800.0
 2019-03-29  118.320000  116.959999  118.070000  117.940002   25399800.0
 2019-04-01  119.110001  118.099998  118.949997  119.019997   22789100.0
 2019-04-02  119.480003  118.519997  119.059998  119.190002   18142300.0
 2019-04-03  120.430000  119.150002  119.860001  119.970001   22860700.0
 2019-04-04  120.230003  118.379997  120.099998  119.360001   20112800.0
 2019-04-05  120.230003  119.370003  119.389999  119.889999   15826200.0
 2019-04-08  120.019997  118.639999  119.809998  119.930000   15116200.0
 2019-04-09  119.540001  118.580002  118.629997  119.279999   17612000.0
 2019-04-10  120.349998  119.540001  119.760002  120.190002   16477200.0
 2019-04-11  120.849998  119.919998  120.540001  120.330002   14209100.0
 2019-04-12  120.980003  120.370003  120.639999  120.949997   19745100.0
 2019-04-15  121.580002  120.570000  120.940002  121.050003   15792600.0
 2019-04-16  121.650002  120.099998  121.639999  120.769997   14071800.0
 2019-04-17  121.849998  120.540001  121.239998  121.769997   19300900.0
 2019-04-18  123.519997  121.300003  122.190002  123.370003   27991000.0
 2019-04-22  124.000000  122.570000  122.620003  123.760002   15648700.0
 2019-04-23  125.580002  123.830002  124.099998  125.440002   24025500.0
 2019-04-24  125.849998  124.519997  125.790001  125.010002   31257000.0
 2019-04-25  131.369995  128.830002  130.059998  129.149994   38033900.0
 2019-04-26  130.520004  129.020004  129.699997  129.889999   23654900.0
 2019-04-29  130.179993  129.350006  129.899994  129.770004   16324200.0
 2019-04-30  130.699997  129.389999  129.809998  130.600006   24166500.0
 2019-05-01  130.649994  127.699997  130.529999  127.879997   26821700.0
 2019-05-02  128.000000  125.519997  127.980003  126.209999   27350200.0
 2019-05-03  129.429993  127.250000  127.360001  128.899994   24911100.0
 2019-05-06  128.559998  126.110001  126.389999  128.149994   24239800.0
 2019-05-07  127.180000  124.220001  126.459999  125.519997   35355100.0

              Adj Close
 Date
 2009-12-31   24.241983
 2010-01-04   24.615801
 2010-01-05   24.623755
 2010-01-06   24.472631
 2010-01-07   24.218124
 2010-01-08   24.385145
 2010-01-11   24.074966
 2010-01-12   23.915895
 2010-01-13   24.138592
 2010-01-14   24.623755
 2010-01-15   24.544212
 2010-01-19   24.735104
 2010-01-20   24.329473
 2010-01-21   23.868181
 2010-01-22   23.033073
 2010-01-25   23.319397
 2010-01-26   23.462553
 2010-01-27   23.597769
 2010-01-28   23.192135
 2010-01-29   22.412704
 2010-02-01   22.595629
 2010-02-02   22.635405
 2010-02-03   22.770605
 2010-02-04   22.142290
 2010-02-05   22.285454
 2010-02-08   22.046848
 2010-02-09   22.277498
 2010-02-10   22.261591
 2010-02-11   22.364988
 2010-02-12   22.213871
 ...                ...
 2019-03-26  117.910004
 2019-03-27  116.769997
 2019-03-28  116.930000
 2019-03-29  117.940002
 2019-04-01  119.019997
 2019-04-02  119.190002
 2019-04-03  119.970001
 2019-04-04  119.360001
 2019-04-05  119.889999
 2019-04-08  119.930000
 2019-04-09  119.279999
 2019-04-10  120.190002
 2019-04-11  120.330002
 2019-04-12  120.949997
 2019-04-15  121.050003
 2019-04-16  120.769997
 2019-04-17  121.769997
 2019-04-18  123.370003
 2019-04-22  123.760002
 2019-04-23  125.440002
 2019-04-24  125.010002
 2019-04-25  129.149994
 2019-04-26  129.889999
 2019-04-29  129.770004
 2019-04-30  130.600006
 2019-05-01  127.879997
 2019-05-02  126.209999
 2019-05-03  128.899994
 2019-05-06  128.149994
 2019-05-07  125.519997

 [2352 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close      Volume  \
 Date
 2009-12-31   310.679321   307.986847   310.356445   307.986847   2455400.0
 2010-01-04   312.721039   310.103088   311.449310   311.349976   3937800.0
 2010-01-05   311.891449   308.761810   311.563568   309.978882   6048500.0
 2010-01-06   310.907837   301.220856   310.907837   302.164703   8009000.0
 2010-01-07   303.029083   294.410156   302.731018   295.130463  12912000.0
 2010-01-08   299.675903   292.651581   294.087250   299.064880   9509900.0
 2010-01-11   300.276978   295.100647   300.276978   298.612823  14519600.0
 2010-01-12   297.147339   292.100159   296.893982   293.332153   9769600.0
 2010-01-13   292.288940   285.095734   286.382355   291.648102  13077600.0
 2010-01-14   295.180145   289.521942   290.063416   293.019196   8535300.0
 2010-01-15   294.862213   287.152344   294.752930   288.126007  10939600.0
 2010-01-19   293.302338   286.283020   288.722137   291.911407   8689500.0
 2010-01-20   291.096710   285.786224   291.096710   288.329681   6543600.0
 2010-01-21   291.513977   284.276062   289.834900   289.606384  12697400.0
 2010-01-22   283.456390   265.701874   280.426086   273.227905  13689200.0
 2010-01-25   273.163330   266.024780   271.528961   268.255249   8897200.0
 2010-01-26   273.024231   266.412231   267.246826   269.457428   8767600.0
 2010-01-27   272.055542   265.925415   268.886169   269.298462   7980200.0
 2010-01-28   271.732635   263.585632   270.485748   265.418701   6500100.0
 2010-01-29   268.747070   261.106750   267.505127   263.257751   8334700.0
 2010-02-01   266.173798   263.436584   265.572693   264.787811   4530800.0
 2010-02-02   265.751556   262.100281   265.751556   263.843964   8245600.0
 2010-02-03   269.298462   262.408295   262.626862   268.662598   6037000.0

In [6]:
import pandas as pd
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})

In [8]:
price.head(10)

                 AAPL         IBM       MSFT        GOOG
Date
2009-12-31  20.073631   99.303009  24.241983  307.986847
2010-01-04  20.386072  100.478867  24.615801  311.349976
2010-01-05  20.421322   99.265091  24.623755  309.978882
2010-01-06  20.096491   98.620255  24.472631  302.164703
2010-01-07  20.059338   98.278870  24.218124  295.130463
2010-01-08  20.192701   99.265091  24.385145  299.064880
2010-01-11  20.014568   98.225777  24.074966  298.612823
2010-01-12  19.786903   99.007156  23.915895  293.332153
2010-01-13  20.066006   98.794746  24.138592  291.648102
2010-01-14  19.949797  100.372673  24.623755  293.019196

In [12]:
price.head(100).to_csv('Yahoo_stock_data.csv')

In [13]:
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [14]:
returns=price.pct_change()

In [15]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-05-01  0.049086  0.002067 -0.020827 -0.017165
2019-05-02 -0.006508 -0.006901 -0.013059 -0.004683
2019-05-03  0.012431  0.004728  0.021314  0.019602
2019-05-06 -0.015443  0.000927 -0.005818  0.003366
2019-05-07 -0.026957 -0.019518 -0.020523 -0.012855

In [18]:
returns['MSFT'].corr(returns['IBM'])

0.4857714017978803

In [19]:
returns.MSFT.corr(returns.IBM)

0.4857714017978803

In [20]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.370625  0.448731  0.455920
IBM   0.370625  1.000000  0.485771  0.403484
MSFT  0.448731  0.485771  1.000000  0.534430
GOOG  0.455920  0.403484  0.534430  1.000000

In [21]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000269  0.000075  0.000107  0.000116
IBM   0.000075  0.000152  0.000087  0.000077
MSFT  0.000107  0.000087  0.000209  0.000119
GOOG  0.000116  0.000077  0.000119  0.000238

Using DataFrame’s corrwith method, you can compute pairwise correlations
between a DataFrame’s columns or rows with another Series or DataFrame. Passing a
Series returns a Series with the correlation value computed for each column:

In [22]:
returns.corrwith(returns.IBM)

AAPL    0.370625
IBM     1.000000
MSFT    0.485771
GOOG    0.403484
dtype: float64

##### Unique Values, Value Counts, and Membership

In [23]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [24]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [31]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [32]:
pd.value_counts(obj.values,sort=False)

b    2
d    1
c    3
a    3
dtype: int64

isin performs a vectorized set membership check and can be useful in filtering a
dataset down to a subset of values in a Series or column in a DataFrame:

In [33]:
mask=obj.isin(['b','d'])

In [34]:
mask

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [35]:
obj[mask]

2    d
5    b
6    b
dtype: object

In [36]:
to_match=pd.Series(list('cabbca'))

In [37]:
unique_vals=pd.Series(list('cba'))

In [40]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [41]:
df1=pd.DataFrame({'price':[1,2,3,4,5],'value':[12,20,30,40,50]},index=list('abcde'))

In [42]:
df1

   price  value
a      1     12
b      2     20
c      3     30
d      4     40
e      5     50

In [43]:
df1.describe()

          price      value
count  5.000000   5.000000
mean   3.000000  30.400000
std    1.581139  15.192103
min    1.000000  12.000000
25%    2.000000  20.000000
50%    3.000000  30.000000
75%    4.000000  40.000000
max    5.000000  50.000000